XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4N1_DFP.pdsc
        <device Dname="TMPM4NRFDXBG">
          <processor Dclock="200000000"/>
          <compile header="Device/Include/TMPM4NR.h" define="TMPM4NR"/>
          <debug svd="SVD/M4NR.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00030000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Nx_code_512.FLM" start="0x00000000" size="0x00080000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Nx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="6"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="146"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="USBOTG"        n="2"/>
          <feature type="BGA" n="177" name="VFBGA 177 13x13x0.8"/>
        </device>

      <!-- ************************  Subfamily 'TMPM4NQx'  **************************** -->

        <!-- ***********************  Device 'TMPM4NQF20x'  ************************* -->
        <device Dname="TMPM4NQF20FG">
          <processor Dclock="200000000"/>
          <compile header="Device/Include/TMPM4NQ.h" define="TMPM4NQ"/>
          <debug svd="SVD/M4NQ.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Nx_code_2048.FLM" start="0x00000000" size="0x00200000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Nx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"   RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="5"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="IOs"           n="118"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="USBOTG"        n="2"/>
          <feature type="QFP" n="144" name="LQFP 144 20x20x0.5"/>
        </device>
        <device Dname="TMPM4NQF20XBG">
          <processor Dclock="200000000"/>
          <compile header="Device/Include/TMPM4NQ.h" define="TMPM4NQ"/>
          <debug svd="SVD/M4NQ.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00200000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Nx_code_2048.FLM" start="0x00000000" size="0x00200000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Nx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"   RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="5"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="IOs"           n="118"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="USBOTG"        n="2"/>
          <feature type="BGA" n="145" name="VFBGA 145 12x12x0.8"/>
        </device>
        <!-- ***********************  Device 'TMPM4NQF15x'  ************************* -->
        <device Dname="TMPM4NQF15FG">
          <processor Dclock="200000000"/>
          <compile header="Device/Include/TMPM4NQ.h" define="TMPM4NQ"/>
          <debug svd="SVD/M4NQ.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Nx_code_1536.FLM" start="0x00000000" size="0x00180000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Nx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="5"/>
          <feature type="I2C"           n="5"                           name="I2C"/>
          <feature type="ADC"           n="24"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="IOs"           n="118"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="USBOTG"        n="2"/>
          <feature type="QFP" n="144" name="LQFP 144 20x20x0.5"/>
        </device>
        <device Dname="TMPM4NQF15XBG">
          <processor Dclock="200000000"/>
          <compile header="Device/Include/TMPM4NQ.h" define="TMPM4NQ"/>
          <debug svd="SVD/M4NQ.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00180000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Nx_code_1536.FLM" start="0x00000000" size="0x00180000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Nx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <!--book name=""/-->

