XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4N1_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="14"      m="32"/>
          <feature type="DMA"           n="3"                           name="DMA"/>
          <feature type="UART"          n="3"/>
          <feature type="I2C"           n="3"                           name="I2C"/>
          <feature type="ADC"           n="16"     m="12"               name="AD converter"/>
          <feature type="ExtInt"        n="9"/>
          <feature type="IOs"           n="86"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="I2S"           n="2" />
          <feature type="USBOTG"        n="1"/>
          <feature type="QFP"           n="100" name="LQFP 100 14x14x0.5"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM4Nx Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>   
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM4NRx CMSIS">
      <description>Toshiba TMPM4NRx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4NR*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4NQx CMSIS">
      <description>Toshiba TMPM4NQx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4NQ*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4NNx CMSIS">
      <description>Toshiba TMPM4NNx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4NN*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup TMPM4NRx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4NRx CMSIS">
      <description>System Startup for Toshiba TMPM4NRx Devices</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_TMPM4NRx      /* Device Startup for TMPM4NRx */
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Nx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4NR.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4NR.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Nx.c"      attr="config" version="1.0.0" condition="TMPM4Nx Compiler"/>
      </files>
    </component>
    <!-- Startup TMPM4NQx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4NQx CMSIS">
      <description>System Startup for Toshiba TMPM4NQx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Nx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4NQ.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4NQ.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Nx.c"      attr="config" version="1.0.0" condition="TMPM4Nx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4NNx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4NNx CMSIS">
      <description>System Startup for Toshiba TMPM4NNx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4Nx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4NN.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4NN.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4Nx.c"      attr="config" version="1.0.0" condition="TMPM4Nx Compiler"/>
      </files>
    </component>

  </components>

</package>
